dianrong/controllers/ActivityController.php

	public function init(){
		$this->cookie=Yii::$app->getRequest()->getCookies()->getValue('user');
		if(!empty($this->cookie)){
			$this->userinfo=User::find()->where("uid=$this->cookie")->asArray()->one();
---
SELECT * FROM `user` WHERE uid=14

	public function actionBorrow(){
		if(empty($this->cookie)){
			return $this->actionMsg("请先登录","login/login",3);
		}
		$data['status']=1;//默认全部验证成功
		if($this->userinfo['id_card']==''){
			$data['status']=2;//设置为没有绑定身份信息
		}
		$my_card=Card::find()->where("uid=$this->cookie")->asArray()->all();
		$data['my_card']=$my_card;
		if(empty($my_card)){
			$data['my_card']="";
			$data['status']=3;//没有绑定银行卡信息
		}
		$data['borrow']=Borrow::find()->where("uid=$this->cookie")->asArray()->all();
---
SELECT * FROM `card` WHERE uid=14
SELECT * FROM `borrow` WHERE uid=14

	public function actionSendgold(){
		if(empty($this->cookie)){
			return $this->actionMsg("请先登录","login/login",3);
		}
		$data['activity']=Activity::find()->asArray()->all();
		$data['is_buy']=Buy::find()->where("uid=$this->cookie and status=0")->asArray()->all();
---
SELECT * FROM `activity`
SELECT * FROM `buy` WHERE uid=14 and status=0