dianrong/controllers/IndexController.php

SELECT * FROM `user` WHERE uid=14
---
	public function actionIndex(){
		$uid=Yii::$app->getRequest()->getCookies()->getValue('user');
		$data=array();
		if(!empty($uid)){
			$data['userinfo']=User::find()->where("uid=$uid")->asArray()->one();