dianrong/controllers/LoginController.php

SELECT * FROM `user` WHERE ((email='152177701@qq.com') AND (upwd='25d55ad283aa400af464c76d713c07ad')) OR ((tel='152177701@qq.com') AND (upwd='25d55ad283aa400af464c76d713c07ad'))
---
	public function actionLogin(){//登录模块
		if(Yii::$app->request->isPost){
			$post=Yii::$app->request->post();
			$upwd=md5($post['upwd']);
			if($user=User::find()->where(['or',['and',"email='$post[uname]'","upwd='$upwd'"],['and',"tel='$post[uname]'","upwd='$upwd'"]])->asArray()->one()){//存在的话登录成功

SELECT * FROM `user` WHERE email='13611369402@163.com'
---
	public function actionCheck_email(){
		$email=Yii::$app->request->get("email");
		if(empty($content=User::find()->where("email='$email'")->asArray()->one())){

SELECT * FROM `user` WHERE uid=14
---
	public function actionGetname($id){
		$user=User::find()->where("uid=$id")->asArray()->one();