dianrong/controllers/UserController.php

SELECT * FROM `user` WHERE uid=14
---
	public function init(){
		$this->cookie=Yii::$app->getRequest()->getCookies()->getValue('user');
		if(!empty($this->cookie)){
			$this->userinfo=User::find()->where("uid=$this->cookie")->asArray()->one();

SELECT * FROM `card` WHERE uid=14
---
	public function actionPay(){//充值提现
		if(empty($this->cookie)){
			return $this->actionMsg("请先登录","login/login",3);
		}
		$data['status']=1;//默认全部验证成功
		if($this->userinfo['id_card']==''){
			$data['status']=2;//设置为没有绑定身份信息
		}
		$my_card=Card::find()->where("uid=$this->cookie")->asArray()->all();

SELECT * FROM `card` WHERE uid=14
---
	public function actionMy_card(){
		if(empty($this->cookie)){
			return $this->actionMsg("请先登录","login/login",3);
		}
		$data['status']=1;
		if($this->userinfo['id_card']==''){
			$data['status']=2;//设置为没有绑定身份信息
		}
		$my_card=Card::find()->where("uid=$this->cookie")->asArray()->all();

SELECT * FROM `user` WHERE uid=14
INSERT INTO `borrow` (`type`, `gold`, `all_gold`, `lixi`, `month_gold`, `last_month_gold`, `add_time`, `will_month`, `ready_month`, `uid`) VALUES (6, '2', '2.11', '0.11', '0.35', '0.36', 1496645434, '2017-7-20,2017-8-20,2017-9-20,2017-10-20,2017-11-20,2017-12-20', 0, 14)
UPDATE `user` SET `all_gold`='765428577.98', `owe_gold`='398.7' WHERE `uid`=14
---
	public function actionBorrow_do(){//有钱花借款
		$post=Yii::$app->request->post();
		$user=User::find()->where("uid=$this->cookie")->one();
		$t=date("m",time());
		$y=date("Y",time());
		$str='';
		for($i=1;$i<=$post['type'];$i++){
			if($t>=12){
				$t=1;
				$y++;
				$str.=",".$y."-".$t."-20";
			}else{
				$t++;
				$str.=",".$y."-".$t."-20";
			}
		}
		$str=substr($str,1);
		$borrow=new Borrow();
		$borrow->type=$post['type'];
		$borrow->gold=$post['gold'];
		$borrow->all_gold=$post['all_gold'];
		$borrow->lixi=$post['lixi'];
		$borrow->month_gold=$post['month_gold'];
		$borrow->last_month_gold=$post['last_month_gold'];
		$borrow->add_time=time();
		$borrow->will_month=$str;
		$borrow->ready_month=0;
		$borrow->uid=$this->cookie;
		$this->actionAddhistory("有钱花借款","有钱花",$post['gold']);
		if($borrow->insert()){
			$user->owe_gold=$this->userinfo['owe_gold']+$post['all_gold'];
			$user->all_gold=$this->userinfo['all_gold']+$post['gold'];
			$user->save();

SELECT * FROM `borrow` WHERE bid=7
UPDATE `borrow` SET `ready_month`=1 WHERE `bid`=7
SELECT * FROM `user` WHERE uid=14
UPDATE `user` SET `all_gold`='765428577.63', `owe_gold`='398.35' WHERE `uid`=14
---
	public function actionHuan(){//有钱花还款
		$post=Yii::$app->request->post();
		$borrow=Borrow::find()->where("bid=$post[bid]")->one();
		$borrow->ready_month=$post['ready_month']+1;
		$borrow->save();
		$user=User::find()->where("uid=$this->cookie")->one();
		$user->all_gold=$this->userinfo['all_gold']-$post['gold'];
		$user->owe_gold=$this->userinfo['owe_gold']-$post['gold'];
		if($post['ready_month']+1==$post['type']){
			$user->owe_gold=0;
		}
		if($user->save()){

SELECT * FROM `user` WHERE uid=14
UPDATE `user` SET `all_gold`='765428575.98', `will_gold`='3115.52' WHERE `uid`=14
INSERT INTO `buy` (`aid`, `uid`, `start_time`, `end_time`, `start_gold`, `end_gold`, `is_back`, `status`) VALUES (3, 14, 1496645386, 1499237386, '3000.00', '3115.52', 0, 0)
---
	public function actionBuyactivity(){//购买理财产品
		$post=Yii::$app->request->post();
		$user=User::find()->where("uid=$this->cookie")->one();
		$user->all_gold=$this->userinfo['all_gold']-$post['start_gold'];
		$user->will_gold=$post['end'];
		$user->save();
		$buy= new Buy();
		$buy->aid=$post['aid'];
		$buy->uid=$this->cookie;
		$buy->start_time=time();
		$buy->end_time=time()+3600*24*$post['t'];
		$buy->start_gold=$post['start_gold'];
		$buy->end_gold=$post['end'];
		$buy->is_back=0;
		$buy->status=0;
		$buy->insert();